In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os
import seaborn as sns

In [6]:
cd ..

C:\Users\vh6tgd

In [7]:
train_data = pd.read_csv('./Desktop/train_data/train.csv')
customer_data = pd.read_csv('./Desktop/train_data/customer_demographics.csv')
transaction_data = pd.read_csv('./Desktop/train_data/customer_transaction_data.csv')
coupon_item_data = pd.read_csv('./Desktop/train_data/coupon_item_mapping.csv')
campaign_data = pd.read_csv('./Desktop/train_data/campaign_data.csv')
item_data = pd.read_csv('./Desktop/train_data/item_data.csv')

In [9]:
merged = pd.merge(train_data,customer_data, on=['customer_id'])

In [10]:
merged.head()

,id,campaign_id,coupon_id,customer_id,redemption_status,age_range,marital_status,rented,family_size,no_of_children,income_bracket
0,1,13,27,1053,0,46-55,NaN,0,1,NaN,5
1,2444,13,513,1053,0,46-55,NaN,0,1,NaN,5
2,3651,13,166,1053,0,46-55,NaN,0,1,NaN,5
3,7712,13,766,1053,0,46-55,NaN,0,1,NaN,5
4,15317,13,165,1053,0,46-55,NaN,0,1,NaN,5

In [12]:
merged1 = pd.merge(train_data,customer_data, on=['customer_id'], how = 'left')

In [13]:
merged1.shape

(78369, 11)

In [14]:
train_data.shape

(78369, 5)

In [28]:
merged1.isnull().count

<bound method DataFrame.count of           id  campaign_id  coupon_id  customer_id  redemption_status  \
0      False        False      False        False              False
1      False        False      False        False              False
2      False        False      False        False              False
3      False        False      False        False              False
4      False        False      False        False              False
...      ...          ...        ...          ...                ...
78364  False        False      False        False              False
78365  False        False      False        False              False
78366  False        False      False        False              False
78367  False        False      False        False              False
78368  False        False      False        False              False

       age_range  marital_status  rented  family_size  no_of_children  \
0          False            True   False        False            True
1          False           False   False        False            True
2          False           False   False        False            True
3           True            True    True         True            True
4          False           False   False        False            True
...          ...             ...     ...          ...             ...
78364      False           False   False        False            True
78365      False           False   False        False            True
78366       True            True    True         True            True
78367      False           False   False        False           False
78368       True            True    True         True            True

       income_bracket
0               False
1               False
2               False
3                True
4               False
...               ...
78364           False
78365           False
78366            True
78367           False
78368            True

[78369 rows x 11 columns]>

In [ ]:
#merged_on_coupon = pd.merge(train_data,, on=['coupon_id'])

In [30]:
transaction_data.head()

,date,customer_id,item_id,quantity,selling_price,other_discount,coupon_discount
0,2012-01-02,1501,26830,1,35.26,-10.69,0.0
1,2012-01-02,1501,54253,1,53.43,-13.89,0.0
2,2012-01-02,1501,31962,1,106.50,-14.25,0.0
3,2012-01-02,1501,33647,1,67.32,0.00,0.0
4,2012-01-02,1501,48199,1,71.24,-28.14,0.0

In [31]:
campaign_data.head()

   campaign_id campaign_type start_date  end_date
0           24             Y   21/10/13  20/12/13
1           25             Y   21/10/13  22/11/13
2           20             Y   07/09/13  16/11/13
3           23             Y   08/10/13  15/11/13
4           21             Y   16/09/13  18/10/13

In [42]:
merging = pd.merge(train_data,campaign_data,on=['campaign_id'])

In [43]:
merging.shape

(78369, 8)

In [38]:
train_data['campaign_id'].nunique()

18

In [39]:
campaign_data['campaign_id'].nunique()

28

In [44]:
merged2 = pd.merge(merged1, campaign_data, on=['campaign_id'])

In [45]:
merged2.shape

(78369, 14)

In [46]:
coupon_item_data

       coupon_id  item_id
0            105       37
1            107       75
2            494       76
3            522       77
4            518       77
...          ...      ...
92658         32    69268
92659         32    68502
92660         32    68612
92661         33    71390
92662         31    70030

[92663 rows x 2 columns]

In [85]:
train_data.head()

   id  campaign_id  coupon_id  customer_id  redemption_status
0   1           13         27         1053                  0
1   2           13        116           48                  0
2   6            9        635          205                  0
3   7           13        644         1050                  0
4   9            8       1017         1489                  0

In [49]:
item_data.head()

   item_id  brand   brand_type       category
0        1      1  Established        Grocery
1        2      1  Established  Miscellaneous
2        3     56        Local         Bakery
3        4     56        Local        Grocery
4        5     56        Local        Grocery

In [86]:
mergedd = pd.merge(train_data, coupon_item_data, on=['coupon_id'], how='left')

In [83]:
m = train_data.join(coupon_item_data, rsuffix='_r', how='left', on=['coupon_id']);
m.shape

(78369, 7)

In [59]:
mergedd.shape

(6420694, 6)

In [52]:
coupon_item_data.shape

(92663, 2)

In [53]:
coupon_item_data['coupon_id'].nunique()

1116

In [54]:
train_data['coupon_id'].nunique()

866

In [66]:
ci_data = pd.merge(transaction_data, customer_data, on=['customer_id'],how = 'left')

In [67]:
ci_data.shape

(1324566, 13)

In [63]:
transaction_data.shape

(1324566, 7)

In [68]:
trans_item = pd.merge(transaction_data, item_data, on=['item_id'])

In [69]:
trans_item.shape

(1324566, 10)

In [70]:
transaction_data['item_id'].nunique()

74063

In [71]:
merged_d = pd.merge(trans_item, coupon_item_data, on=['item_id'])
merged_d.shape

(2101361, 11)

In [88]:
pwd

'C:\\Users\\vh6tgd'